
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьНаФорме();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидимостьНаФорме();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Для учебных целей упрощенная запись 
// В реальности нужна дирректива на клиенте и сенвере без контекста - код в поц будет другой

&НаСервере
Процедура ВидимостьНаФорме()
	
	// Создаем переменную с типом Булево
	ЭтоПосещениеАттракциона = (Объект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ПосещениеАттракциона);
	
	// Сравниваем ее с нужным элементом формы
	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракциона;
	
КонецПроцедуры

#КонецОбласти
