
#Область ПрограммныйИнтерфейс

// Нормализованный номер телефона.
// 
// Параметры:
// НомерТелефона - строка 
// 
// Возвращаемое значение: 
// строка
// 
Функция НормализованныйНомерТелефона(Телефон, ВызыватьИсключение = Ложь) Экспорт
	
	Цифра = "0123456789";
	
	ЦифрыТелефона = "";
	
	Для Сч = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, Сч, 1);
		Если СтрНайти(Цифра, Символ) = 0 Тогда
			Продолжить;
		КонецЕсли;				
		
		ЦифрыТелефона = ЦифрыТелефона + Символ;
					
	КонецЦикла; 
	
	Если СтрНачинаетсяС(ЦифрыТелефона, "8") Тогда
		// берем все символы, начиная со второго и до конца строки (третий параметр не передаем)
		ЦифрыТелефона = "7" + Сред(ЦифрыТелефона, 2);
	КонецЕсли;
	
	Ошибки = Новый Массив;
	
	Если НЕ СтрНачинаетсяС(ЦифрыТелефона, "7") Тогда
		Ошибки.Добавить("Номер телефона должен начинаться с 7 или 8");	
	КонецЕсли;
	
	Если НЕ СтрДлина(ЦифрыТелефона) = 11 Тогда
		Ошибки.Добавить("Номер телефона должен содержать 11 цифр");
	КонецЕсли;
	
	Если Ошибки.Количество() > 0  Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение СтрСоединить(Ошибки, "; ");
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЦифрыТелефона;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
