
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	// Обязательная проверка ОбменДанными.Загрузка по требования стандарта
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Телефон = НомераТелефоновКлиентСервер.НормализованныйНомерТелефона(Телефон, Истина);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
